{
  "extends": [
    "apollo-open-source"
  ],
  schedule: null,
  "dependencyDashboard": true,
  // The "circleci" manager is intentionally disabled right now (e.g., not
  // included in this list).  While we do benefit from its updating of "Orb"
  // versions, the CircleCI manager also attempts to update Docker images using
  // its "Docker" datasource.  This is really handy, in theory, but we have
  // intentionally varying major Node.js docker image identifiers in our
  // CircleCI configuration to test on each major Node.js platform.  Enabling
  // the "circleci" manager would cause all of these to update to the latest
  // version (e.g., 16) when we want them to be intentionally different!
  // I'm going to try to craft an fix for this, but I might do it upstream
  // on Renovate itself using its Regex manager.  It's also worth noting that
  // there is other configuration that could be used to _only_ renovate "orbs"
  // on this file, but I'm taking the short-cut route and not juggling with
  // that right now.  I can test the repository locally with my own copy of
  // Renovate and come up with another solution given some free time. -Jesse
  "enabledManagers": ["npm", "cargo"],
  "packageRules": [
    // We set this to the lowest supported Node.js version to ensure we don't
    // use newer Node.js APIs unknowingly during development which are going to
    // fail in CI anyway when they're run against the full range of Node.js
    // versions we support.
    {
      "matchPackageNames": ["@types/node"],
      "allowedVersions": "12.x"
    },
    // make-fetch-happen is used by the HttpRequestCache in gateway, which uses
    // a cache API that is removed in v9.
    {
      "matchPackageNames": ["make-fetch-happen"],
      "allowedVersions": "8.x"
    },
    // Bunch up all non-major npm dependencies into a single PR.  In the common case
    // where the upgrades apply cleanly, this causes less noise and is resolved faster
    // than starting a bunch of upgrades in parallel for what may turn out to be
    // a suite of related packages all released at once.
    {
      groupName: "all non-major dependencies",
      matchUpdateTypes: ["patch", "minor"],
      groupSlug: "all-npm-minor-patch",
      matchManagers: [ "npm" ],
    },
    {
      "matchPaths": [
        "docs/package.json"
      ],
      "extends": [
        "apollo-docs"
      ],
      // "Past" major version branches, preserved as
      // "version-[0-9]" branches, should be added here!
      // See Apollo Server or Apollo Client repos for examples.
      "baseBranches": [
        "main"
      ]
    }
  ]
}
